Jmeter/results/harness-check-20260902-140147/console.log
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
[...]
Creating summariser <summary>
Created the tree successfully using queue-load.jmx
Starting standalone test @ 2026 Sep 2 14:01:50 UTC (1788357710209)
Waiting for possible Shutdown/StopTestNow/HeapDump/ThreadDump message on port 4445
summary =      1 in 00:00:00 =    2.8/s Avg:    54 Min:    54 Max:    54 Err:     0 (0.00%)
Tidying up ...    @ 2026 Sep 2 14:01:51 UTC (1788357711047)
... end of run