Jmeter/results/smoke-20260902-150645/console.log
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
[...]
Creating summariser <summary>
Created the tree successfully using queue-load.jmx
Starting standalone test @ 2026 Sep 2 15:06:47 UTC (1788361607531)
Waiting for possible Shutdown/StopTestNow/HeapDump/ThreadDump message on port 4445
summary =      2 in 00:00:01 =    1.7/s Avg:   234 Min:    63 Max:   406 Err:     2 (100.00%)
Tidying up ...    @ 2026 Sep 2 15:06:49 UTC (1788361609074)
... end of run